Rhino.Inside.Revit API
GeometryEncoder.ToMesh Method (Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Mesh.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Autodesk.Revit.DB.Mesh ToMesh(
	this Rhino.Geometry.Extrusion extrusion
)
@staticmethod
def ToMesh(
	extrusion: Rhino.Geometry.Extrusion
) -> Autodesk.Revit.DB.Mesh
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
Rhino extrusion to convert.
Return Value
Type: Autodesk.Revit.DB.Mesh
Revit mesh that is equivalent to the provided Rhino extrusion.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Extrusion. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToMesh(Extrusion) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Mesh revitMesh = rhinoExtrusion.ToMesh();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_mesh = rhino_extrusion.ToMesh()    # type: DB.Mesh
 Using ToMesh(Extrusion) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Mesh revitMesh = GeometryEncoder.ToMesh(rhinoExtrusion);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_mesh = GE.ToMesh(rhino_extrusion)    # type: DB.Mesh
See Also
Reference
GeometryEncoder Class
ToMesh Overload
RhinoInside.Revit.Convert.Geometry Namespace